{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "RESUME- Abdul Muqeet Ahmad.pdf",
    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "I have <span class='underline'>5 years of experience</span> developing frontends, systems, interfaces, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular, React, NodeJS </span> and sometimes in <span class='underline'>Java Spring Boot</span> applying good practices and development standards.",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        "In my <span class='underline'>5 years as a developer</span>, I am committed to continuous learning and growth. I have extensive experience writing <span class='underline'>unit tests</span>, <span class='underline'>performing continuous integration</span>, and covering backend developer roles with <span class='underline'>NodeJS and  Mysql</span>. As a frontend team lead, I have successfully led teams by fostering empathy, motivating colleagues, and collaboratively setting plans and goals.",
        "My skills also encompass implementing system improvements, optimizing sites, standardizing patterns, and proposing and executing ideas that add significant value to projects.",
        "Some of the technologies that I have trained and worked on include (but are not limited to):"
    ],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "Introtech Solutions",
            "Title": "Senior Software Engineer / Team Lead",
            "Date": "January 2022 - Present",
            "Description": [
                "Lead a team of developers in designing and implementing scalable and performant Angular applications, driving the adoption of best practices and ensuring consistent code quality.",
                "Architect robust frontend solutions, integrating complex user interfaces with RESTful APIs, and enhancing user experiences through intuitive designs and smooth interactions.",
                "Mentor junior developers, conducting code reviews and knowledge-sharing sessions, resulting in skill development and an empowered team delivering high-quality software.",
                "Collaborate closely with cross-functional teams including UX/UI designers and backend engineers to define requirements, troubleshoot issues, and deliver feature-rich applications on time.",
                "Spearhead the migration of legacy applications to modern Angular versions, optimizing codebase and refactoring for improved maintainability and enhanced application performance",
                "Planning meetings in reports.",
                "Designed and implemented RESTful APIs to support multiple applications",
                "Built a real-time notification system using WebSockets, increasing communication and collaboration among users.",
                "Improved website performance by optimizing images and implementing caching techniques.",
                "Implementation of continuous integration and daily backups."
            ],
            "ToolsSkills": "Angular 16, JavaScript, TypeScript, Angular Material, Angular Flex, Chart JS, RXJS, HTML5, SASS/SCSS,CSS3, GIT, Azure DevOps, Swagger, Karma, Jasmine, JMeter, Java Spring boot, Maven, MySQL, VS Code, Intelli "
        },
        {
            "Tab": "Introtech Solutions",
            "Title": "Software Frontend Engineer",
            "Date": "October 2020 - December 2021",
            "Description": [
                "Developed and maintained responsive web applications using the Angular framework, translating design mockups into interactive, pixel-perfect user interfaces.",
                "Collaborated with cross-functional teams to implement frontend features, ensuring seamless integration with backend services and APIs for data retrieval and manipulation.",
                "Implemented efficient state management using RxJS observables, enhancing application performance and user experience through real-time data updates.",
                "Actively engaged in continuous learning and skill enhancement, staying current with industry trends andcontributing innovative ideas to improve development processes.",
                "Participated in code reviews, conducting thorough analysis to identify and address code quality issues,resulting in improved codebase and reduced bugs.",
                "Coding of API requests with RxJS.",
                "Creation of modules with complex reactive forms",
                "Collaborated with designers and back-end developers to create responsive and user-friendly web experiences"
            ]
        },
        {
            "Tab": "Amigo Software",
            "Title": "Junior Frontend Engineer",
            "Date": "June 2020 - September 2020",
            "Description": [
                "Contributed to the development of interactive web applications using Angular, collaborating with senior developers to implement frontend features and enhance user experiences.",
                "Assisted in optimizing application performance by implementing responsive designs, code refactoring, and efficient data rendering techniques.",
                "Actively participated in team discussions and code reviews, offering insights and suggestions to improve code quality, maintainability, and overall project delivery.",
                "Supported the integration of RESTful APIs, ensuring seamless communication between frontend and backend systems for data retrieval and updates.",
                "Engaged in continuous learning and professional development, exploring new Angular features, libraries, and best practices to enhance skills and contribute to project innovation."
            ]
        },
        {
            "Tab": "Freelancer",
            "Title": "Independent",
            "Date": "January 2018 - Present",
            "Description": [
                "Implementing continuous improvements, working on frontend and backend.",
                "Creating platforms with Angular, Nodejs, ExpressJS, programmed with functional, reactive, and object-oriented programming paradigms.",
                "Worked in the development of CRM, Added new modules of billing and incentives, implemented Google Map clustering",
                "Design and developed a frontend of Virtual Classroom during covid days consuming SDK's",
                "Converted design from Figma to HTML5, Angular.",
                "Design layout with SASS, Bootstrap, Materialize, Prime Faces, etc."
            ]
        }
    ],
    "FeatureProjects.Title": "Projects that I was a part of",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "Rainbow LMS",
            "Description": "Rainbow LMS is an online virtual e-learning platform that helps institutes set up their complete virtual identity. With the help of this LMS, institutes can have a proper view of their staff and students to refrain from any cautious activity. There are these roles: <span class='underline'>Admin </span>, <span class='underline'>Teacher </span>, <span class='underline'>TA </span>, <span class='underline'>Student</span>, and <span class='underline'> Parent </span>. Features:1: <span class='underline'> Audio Video Classroom Sessions. </span> 2: <span class='underline'>Test, Quiz, Exam Conductions. </span> 3: <span class='underline'> File Sharing. </span> 4: <span class='underline'> Profile Management. </span> 5: <span class='underline'> Parent-Teacher Sessions. </span> 6: <span class='underline'> Classroom Notes. </span> 7: <span class='underline'> Classroom Settings. </span> 8: <span class='underline'>Breakout rooms. </span> 9: <span class='underline'> Whiteboards </span> 10: <span class='underline'> Classroom session recording </span>",
            "imgs": [
                "assets/images/rainbow/rainbow-lms-jpg.jpg",
                "assets/images/rainbow/rainbow-lms1jpg.jpg"
            ],
            "Technologies": [
                "Angular 12",
                "SCSS",
                "TypeScript",
                "Angular Material",
                "RxJS",
                "Nodejs",
                "Expressjs",
                "MongoDB"
            ]
        },
        {
            "Title": "HRM Portal",
            "Description": " I developed a Human Resource Management (HRM) portal that caters to both <span class='underline'> companies </span> and <span class='underline'> employees </span>. The portal features distinct roles for companies and employees, allowing for efficient management of <span class='underline'> leave </span>, <span class='underline'> daily announcements </span>,<span class='underline'> memos </span>,<span class='underline'> attendance </span>,<span class='underline'> salary records </span>, and a <span class='underline'> policy module </span>. The policy module enables HR to create policies that apply universally across the portal, ensuring consistency and compliance throughout the organization. It's a comprehensive solution designed to streamline HR processes and enhance organizational efficiency.",
            "imgs": [
                "assets/images/hrm/hrm_portal_front-transformed.jpeg",
                "assets/images/hrm/hrm portal 2.JPG"
            ],
            "Technologies": [
                "Angular 6",
                "SASS",
                "Angular Material",
                "RxJS",
                "TypeScript",
                "JQuery",
                "SDK Integration"
            ]
        }
    ],
    "OtherProjects.Title": "More personal projects",
    "OtherProjects.Projects": [
        {
            "Title": "Real Estate Agents - Search",
            "Description": "A fun side project: a search tool for finding registered real estate agents in the area using Google Maps.",
            "ghLink": "",
            "Technologies": [
                "Angular 10",
                "Angular Material",
                "SASS",
                "3rd Party Integration",
                "RxJS",
                "TypeScript",
                "Nodejs",
                "Firebase"
            ]
        },
        {
            "Title": "Artist In Town",
            "Description": "Artist in Town is a web app built with 3rd party API integration that displays records of local artists and their events, along with ticket availability.",
            "ghLink": "https://github.com/abdulmuqeet25/artistInTownSearcEngine",
            "demoLink": "https://github.com/abdulmuqeet25/artistInTownSearcEngine",
            "Technologies": [
                "Angular 10",
                "Angular Material",
                "RxJs",
                "API Integration",
                "Angular Flex"
            ]
        },
        {
            "Title": "Portfolio Static Website",
            "Description": "A static website designed to showcase my portfolio, featuring a collection of my projects, skills, and professional achievements in a visually appealing and accessible format.",
            "ghLink": "https://abdulmuqeet25.github.io/myportfolio/",
            "demoLink": "https://abdulmuqeet25.github.io/myportfolio/",
            "Technologies": [
                "Javscript",
                "JQuery",
                "HTML5",
                "CSS3",
                "Bootstrap"
            ]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
    "Contact.Btn": "Say Hello",
    "Contact.Btn.via.email": "via Email",
    "Contact.Btn.via.whatsapp": "via Whatsapp"
}